app/controllers/songs_controller.rb

  def upload
    CSV.foreach(params[:file], headers: true) do |song|
      Artist.find_or_create_by(name: song[1])
---
INSERT INTO "artists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", ".38 Special"], ["created_at", "2018-10-16 13:33:32.073565"], ["updated_at", "2018-10-16 13:33:32.073565"]]
INSERT INTO "songs" ("title", "artist_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Caught Up in You"], ["artist_id", 137], ["created_at", "2018-10-16 13:33:32.081695"], ["updated_at", "2018-10-16 13:33:32.081695"]]
SELECT  "artists".* FROM "artists" WHERE "artists"."name" = ? LIMIT 1  [["name", ".38 Special"]]